Repository: ggwmwgg/tgbot
Catalog: locales/*/LC_MESSAGES/tgbot.po
Languages: uz

source: Начать заказ 🍽
uz: Buyurtma berishni boshlang 🍽

source: Оставить отзыв 📝
uz: Sharh qoldiring 📝

source: Мои заказы 🛒
uz: Buyurtmalarim 🛒

source: Контакты 📲
uz: Kontaktlar 📲

source: Настройки 🛠
uz: Sozlamalar 🛠

source: Пользователи 🧑‍🤝‍🧑
uz: Foydalanuvchilar 🧑‍🤝‍🧑

source: Заказы 🛒
uz: Buyurtmalar 🛒

source: Назад 🔙
uz: Orqaga 🔙

source: Вы успешно авторизовались
uz: Siz muvaffaqiyatli tizimga kirdingiz

source: У вас нет прав на эту команду
uz: Sizda bu buyruq bo'yicha huquqingiz yo'q

source: В обработке
uz: Qayta ishlashda

source: Подтвержден
uz: Tasdiqlangan

source: Приготовление
uz: Ovqat pishirish

source: Доставка
uz: Yetkazib berish

source: Обновить список
uz: Ro'yxatni yangilash

source: <b>Здравствуйте, %s!</b> Вам назначено <b>%s</b> заказов. Всего заказов: <b>%s</b> <i>Выберите заказ из списка ниже:</i>
uz: <b>Salom %s!</b> Sizda <b>%s</b> ta buyurtma berilgan. Jami buyurtmalar: <b>%s</b> <i>Quyidagi roʻyxatdan buyurtmani tanlang:</i>

source: Инфо по ID 🆔
uz: ID bo'yicha ma'lumot 🆔

source: Инфо по номеру 📱
uz: Raqam bo'yicha ma'lumot 📱

source: Выберите опцию
uz: Variantni tanlang

source: <i><b>Заказы:</b></i> Количество активных заказов (<b>%s</b>):
uz: <i><b>Buyurtmalar:</b></i> Faol buyurtmalar soni ( <b>%s</b> ):

source: <b>Всего заказов (не считая отмененных)- %s</b> <b>Всего заказов (не считая отмененных и доставленных)- %s</b>
uz: <b>Jami buyurtmalar (bekor qilinganlar bundan mustasno) - %s</b> <b>Jami buyurtmalar (bekor qilingan va yetkazib berilganlar bundan mustasno) - %s</b>

source: Загрузка...
uz: Yuklanmoqda...

source: Все
uz: Hammasi

source: <= Активные
uz: <= Faol

source: Все по филиалу
uz: Hammasi filial bo'yicha

source: Все по id/номеру пользователя
uz: Hammasi foydalanuvchi identifikatori/raqami bo'yicha

source: Инфо по id заказа
uz: Buyurtma identifikatori bo'yicha ma'lumot

source: Choose option
uz: Variantni tanlang

source: ID: %s Name: %s Language: %s Number: %s Username: @%s Orders number: %s Referral link: %s Cashback: %s Banned? %s Rights: %s Registration date: %s Last update date: %s
uz: ID: %s Ism: %s Til: %s Raqam: %s Foydalanuvchi nomi: @%s Buyurtma raqami: %s Yo‘naltiruvchi havola: %s Cashback: %s Taqiqlanganmi? %s Huquqlar: %s Ro‘yxatdan o‘tish sanasi: %s Oxirgi yangilanish sanasi: %s

source: Изменить имя 📝
uz: Ismni o'zgartirish 📝

source: Сменить язык 🗣
uz: Tilni o'zgartirish 🗣

source: Сменить номер 📲
uz: Raqamni o'zgartirish 📲

source: Изменить кешбек 🤑
uz: Keshbekni almashtirish 🤑

source: Бан/Разбан 🟥
uz: Taqiqlash/bekor qilish 🟥

source: Изменить права 🪬
uz: Huquqlarni o'zgartirish 🪬

source: Error: %s
uz: Xato: %s

source: Ошибка: %s
uz: Xato: %s

source: Неверный формат номера Пожалуйста введите номер в формате +998901234567
uz: Raqam formati noto‘g‘ri. Raqamni +998901234567 formatida kiriting

source: ID: %s Имя: %s Язык: %s Номер: %s Имя пользователя: @%s Количество заказов: %s Реферальная ссылка: %s Кешбек: %s Забанен? %s Права: %s Дата регистрации: %s Дата последнего обновления: %s
uz: ID: %s Ism: %s Til: %s Raqam: %s Foydalanuvchi nomi: @%s Buyurtmalar soni: %s Yo‘naltiruvchi havola: %s Cashback: %s Taqiqlanganmi? %s Ruxsatlar: %s Ro‘yxatdan o‘tish sanasi: %s Oxirgi yangilanish sanasi: %s

source: Введите имя для пользователя %s
uz: %s foydalanuvchi nomini kiriting

source: Выберите язык
uz: Tilni tanlang

source: Русский 🇷🇺
uz: Ruscha 🇷🇺

source: Узбекский 🇺🇿
uz: O'zbek 🇺🇿

source: Английский 🇺🇸
uz: Ingliz 🇺🇸

source: Введите номер телефона в формате +998911234567 для пользователя %s
uz: %s foydalanuvchisi uchun telefon raqamini +998911234567 formatida kiriting

source: Введите количество кешбека для пользователя %s
uz: %s foydalanuvchisi uchun naqd pul miqdorini kiriting

source: Выберите действие
uz: Harakatni tanlang

source: Забанить 🟥
uz: Taqiqlash 🟥

source: Разбанить 🟩
uz: Taqiqni olib tashlash 🟩

source: Установите права для пользователя
uz: Foydalanuvchi uchun ruxsatlarni o'rnating

source: Админ 🪬
uz: Admin 🪬

source: Оператор 📞
uz: Operator 📞

source: Курьер 🚚
uz: Kuryer 🚚

source: Пользователь 👨
uz: Foydalanuvchi 👨

source: Имя пользователя %s изменено на %s
uz: Foydalanuvchi nomi %s %s ga o‘zgartirildi

source: Ваше имя изменено на %s
uz: Ismingiz %s ga o‘zgartirildi

source: Язык изменен на %s для пользователя %s
uz: %s foydalanuvchisi uchun til %s ga o‘zgartirildi

source: Номер изменен на %s для пользователя %s
uz: %s foydalanuvchisi uchun raqam %s ga o‘zgartirildi

source: Ваш номер был изменен на %s
uz: Sizning raqamingiz %s ga o‘zgartirildi

source: Неверный формат. Пожалуйста введите номер в формате +998911234567
uz: Noto'gri shakl. Raqamni +998911234567 formatida kiriting

source: Кешбек изменен на %s для пользователя %s
uz: Keshbek %s foydalanuvchisi uchun %s ga o‘zgartirildi

source: Ваш кешбек изменен на %s
uz: Keshbekingiz %s ga o‘zgartirildi

source: Неверный формат. Вводите только цифры
uz: Noto'gri shakl. Faqat raqamlarni kiriting

source: Статус бана измене на %s для пользователя %s
uz: %s foydalanuvchisi uchun taqiq holati %s ga o‘zgartirildi

source: Ваш статус изменен на %s
uz: Sizning holatingiz %s ga o‘zgartirildi

source: Админ
uz: Admin

source: Оператор
uz: Operator

source: Курьер
uz: Kuryer

source: Пользователь
uz: Foydalanuvchi

source: Права изменены на %s для пользователя %s
uz: %s foydalanuvchisi uchun ruxsatlar %s ga o‘zgartirildi

source: Ваши права изменены на %s
uz: Ruxsatlaringiz %s ga o‘zgartirildi

source: Список всех заказов. <i>Выберите заказ из списка ниже:</i>
uz: Barcha buyurtmalar ro'yxati. <i>Quyidagi ro'yxatdan buyurtmani tanlang:</i>

source: Активный
uz: Faol

source: Доставлен
uz: Yetkazib berildi

source: Отменен
uz: Bekor qilingan

source: Список всех активных заказов. <i>Выберите заказ из списка ниже:</i>
uz: Barcha faol buyurtmalar ro'yxati. <i>Quyidagi ro'yxatdan buyurtmani tanlang:</i>

source: <i>Выберите филиал из списка ниже:</i>
uz: <i>Quyidagi ro'yxatdan filialni tanlang:</i>

source: Введите <b>id</b> или <b>номер</b> пользователя:
uz: Foydalanuvchi <b>identifikatori</b> yoki <b>raqamini kiriting</b> :

source: Введите номер заказа
uz: Buyurtma raqamini kiriting

source: <i>Выберите заказ из списка ниже:</i>
uz: <i>Quyidagi ro'yxatdan buyurtmani tanlang:</i>

source: Неверный формат данных!
uz: Ma'lumotlar formati noto'g'ri!

source: Подтвержден ✅
uz: Tasdiqlangan ✅

source: Приготовление 🍳
uz: Ovqat pishirish 🍳

source: Доставка 🚚
uz: Yetkazib berish 🚚

source: Доставлен ✔
uz: Yetkazib beriladi✔

source: Оплачен 🟩
uz: To'langan 🟩

source: Не оплачен 🟥
uz: To'lanmagan 🟥

source: Добавить позицию ➕
uz: Pozitsiyasini qo'shing➕

source: Удалить позицию ✖
uz: Elementni o'chirish ✖

source: Отменить заказ ❌
uz: Buyurtmani bekor qilish ❌

source: Назначить курьера 🏃‍
uz: Kurer tayinlang 🏃‍

source: Заказа с таким номером не существует
uz: Bu raqam bilan buyurtma mavjud emas

source: Статус вашего заказа №%s: %s
uz: №%s buyurtmangiz holati: %s

source: <i><b>Статус: %s</b></i>
uz: <i><b>Holati: %s</b></i>

source: Заказ уже подтвержден
uz: Buyurtma allaqachon tasdiqlangan

source: изменен с приготовления на подтвержден
uz: pishirishdan tasdiqlanganga o'zgartirildi

source: изменен с доставки на подтвержден
uz: yetkazib berishdan tasdiqlanganga o'zgartirildi

source: изменен с доставлен на подтвержден
uz: etkazib berilgandan tasdiqlanganga o'zgartirildi

source: изменен с отменен на подтвержден
uz: bekor qilingandan tasdiqlanganga o'zgartirildi

source: Заказ уже в процессе приготовления
uz: Buyurtma tayyorlanmoqda

source: изменен с доставка на в процессе приготовления
uz: yetkazib berishdan davom etayotganga o'zgartirildi

source: изменен с доставлен на в процессе приготовления
uz: yetkazib berilgandan tayyorlanayotganga o‘zgartirildi

source: изменен с отменен на в процессе приготовления
uz: bekor qilingandan davom etayotganga o‘zgartirildi

source: Заказ уже доставляется
uz: Buyurtma allaqachon jo'natilgan

source: изменен с доставлен на доставляется
uz: yetkazib berishdan yetkazib berishga o‘zgartirildi

source: изменен с отменен на доставляется
uz: bekor qilingandan yetkazib berilganga o‘zgartirildi

source: Назначить курьера 🏃)
uz: Kurer tayinlang 🏃

source: Заказ уже доставлен
uz: Buyurtma allaqachon yetkazib berilgan

source: изменен с отменен на доставлен
uz: bekor qilingandan yetkazib berilganga o‘zgartirildi

source: Заказ уже оплачен
uz: Buyurtma allaqachon to'langan

source: Оплачен
uz: To'langan

source: Ваш заказ №%s оплачен
uz: №%s buyurtmangiz toʻlandi

source: <i>Статус оплаты заказа изменен на <b>%s</b></i>
uz: <i>Buyurtma toʻlovi holati <b>%s ga</b> oʻzgartirildi</i>

source: Назначить курьера 🏃
uz: Kurer tayinlang 🏃

source: Заказ не оплачен
uz: Buyurtma to'lanmagan

source: Не оплачен
uz: To'lanmagan

source: Ваш заказ №%s имеет статус неоплаченного
uz: №%s buyurtmangiz toʻlanmagan

source: <i><b>Статус: %s</b></i>
uz: <i><b>Holati: %s</b></i>

source: Какой товар добавить?
uz: Qaysi elementni qoshish kerak?

source: Какой товар удалить?
uz: Qaysi elementni olib tashlash kerak?

source: Какого курьера назначить?
uz: Qaysi kurerni tayinlash kerak?

source: Невозможно назначить курьера на самовывоз
uz: Olib ketish uchun kurer tayinlab bo‘lmadi

source: Заказ уже отменен
uz: Buyurtma allaqachon bekor qilingan

source: Ваш заказ №%s отменен
uz: №%s buyurtmangiz bekor qilindi

source: <b>Всего заказов (не считая отмененных)- %s</b> <b>Всего заказов (не считая отмененных и доставленных) - %s</b>
uz: <b>Jami buyurtmalar (bekor qilinganlar bundan mustasno) - %s</b> <b>Jami buyurtmalar (bekor qilingan va yetkazib berilganlar bundan mustasno) - %s</b>

source: Выбран товар: <b>%s</b>. Выберите количество из списка ниже.
uz: Tanlangan mahsulot: <b>%s</b> . Quyidagi ro&#39;yxatdan miqdorni tanlang.

source: <b>Товар: <i>%s %sшт</i> добавлен в корзину. Выберите действие</b>
uz: <b>Element: <i>%s %s dona savatga</i> qo‘shildi. Harakatni tanlang</b>

source: <b>Товар: <i>%s %sшт</i> удален из корзины. Выберите действие</b>
uz: <b>Element: <i>%s %spcs savatdan</i> olib tashlandi. Harakatni tanlang</b>

source: Курьер <b>%s</b> назначен
uz: Kuryer <b>%s</b> tayinlandi

source: <i>Вам назначен заказ <b>№%s</b></i>
uz: <i><b>#%s</b> buyurtmasi sizga tayinlandi</i>

source: Курьер с номером <b>%s</b> назначен на Ваш заказ №%s
uz: Kuryer raqami <b>%s</b> #%s buyurtmangizga tayinlangan

source: Такого курьера не существует
uz: Bu kurer mavjud emas.

source: Очистить 🗑
uz: Aniq 🗑

source: Оформить заказ 🚚
uz: Hisob-kitob 🚚

source: Корзина 🛒
uz: Savat 🛒

source: Итого
uz: Jami

source: сум
uz: so'm

source: Нажмите на название товара для его удаления {clear} для очистки корзины {order} для оформления заказа
uz: Uni olib tashlash uchun mahsulot nomini bosing {clear} savatni bo'shatish uchun {order} buyurtma berish uchun

source: Загрузка корзины
uz: Arava yuklanmoqda

source: Ваша корзина пуста
uz: Savatingiz bo'sh

source: Выберите категорию
uz: Kategoriyani tanlang

source: Очистить
uz: Toza 🗑

source: Оформить заказ
uz: Tekshirib ko'rmoq 🚚

source: Корзина
uz: Savat 🛒

source: <i>Товар %s удален из корзины</i>
uz: <i>%s element savatdan olib tashlandi</i>

source: Нажмите на название товара для его удаления %s для очистки корзины %s для оформления заказа
uz: Uni olib tashlash uchun mahsulot nomini bosing %s savatni bo'shatish uchun %s для оформления заказа

source: <b>Корзина очищена</b>
uz: <b>Arava bo‘sh</b>

source: Загрузка заказа
uz: Buyurtma yuklanmoqda

source: Нет комментариев 💭
uz: Izohlar yo'q 💭

source: Неверная команда, используйте кнопки под сообщением
uz: Yaroqsiz buyruq, xabar ostidagi tugmalardan foydalaning

source: <b>Обновлено.</b> Вам назначено <b>%s</b> заказов(а). Всего заказов: <b>%s</b> <i>Выберите заказ из списка ниже:</i>
uz: <b>Yangilangan.</b> Sizda <b>%s</b> ta buyurtma berilgan. Jami buyurtmalar: <b>%s</b> <i>Quyidagi roʻyxatdan buyurtmani tanlang:</i>

source: <b>Заказ <i>№%s</i></b> Тип: <i>Наличные</i> Покупатель: %s Номер: %s Адрес: %s Доставка: %s Итого: %s Статус: <b>%s</b> <i>Выберите действие:</i>
uz: Turi: <i>Naqd pul</i> Покупатель: %s Номер: %s Адрес: %s Доставка: %s Итого: %s Статус: <b>%s</b> <i>Выберите действие:</i>

source: Забрал ✔
uz: Olingan ✔

source: Локация 📍
uz: Manzil 📍

source: Доставил ✔
uz: Yetkazib beriladi✔

source: <b>Заказ <i>№%s</i></b> Тип: %s Покупатель: %s Номер: %s Адрес: %s Статус: <b>%s</b> <i>Выберите действие:</i>
uz: <b>Buyurtma<i>№%s</i></b> Turi: %s Xaridor: %s Raqam: %s Manzil: %s Holat: <b>%s</b> <i>Amalni tanlang:</i>

source: <b>Назад</b> Вам назначено <b>%s</b> заказов(а). Всего заказов: <b>%s</b> <i>Выберите заказ из списка ниже:</i>
uz: <b>Orqaga</b> <b>%s</b> buyurtma berilgan. Jami buyurtmalar: <b>%s</b . <i>Quyidagi roʻyxatdan buyurtmani tanlang:</i>

source: Ваш заказ №%s доставляется курьером.
uz: №%s buyurtmangiz kurer orqali yetkazilmoqda.

source: <b>Спасибо за доставку!</b> Был ли данный заказ (%s) оплачен?
uz: <b>Yetkazib berganingiz uchun tashakkur!</b> Bu buyurtma (%s) toʻlanganmi?

source: Да ✔
uz: Ha ✔

source: Нет ❌
uz: Yo'q ❌

source: Ваш заказ №%s был доставлен. <i>Спасибо за заказ!</i>
uz: #%s buyurtmangiz yetkazib berildi. <i>Buyurtmangiz uchun rahmat!</i>

source: <b>Заказ №%s доставлен! Спасибо.</b> Вам назначено <b>%s</b> заказов(а). Всего заказов: <b>%s</b> <i>Выберите заказ из списка ниже:</i>
uz: <b>#%s buyurtma yetkazib berildi! Rahmat.</b> Sizda <b>%s</b> ta buyurtma berilgan. Jami buyurtmalar: <b>%s</b> <i>Quyidagi roʻyxatdan buyurtmani tanlang:</i>

source: Ваш заказ №%s был доставлен и оплачен. <i>Спасибо за заказ!</i>
uz: №%s buyurtmangiz yetkazib berildi va toʻlandi. <i>Buyurtmangiz uchun rahmat!</i>

source: <b>Заказ №%s доставлен и оплачен! Спасибо.</b> Вам назначено <b>%s</b> заказов(а). Всего заказов: <b>%s</b> <i>Выберите заказ из списка ниже:</i>
uz: <b>#%s buyurtma yetkazib berildi va toʻlandi! Rahmat.</b> Sizda <b>%s</b> ta buyurtma berilgan. Jami buyurtmalar: <b>%s</b> <i>Quyidagi roʻyxatdan buyurtmani tanlang:</i>

source: Ваш заказ №%s был доставлен но не был оплачен. <i>Пожалуйста, свяжитесь с нами.</i>
uz: №%s buyurtmangiz yetkazib berildi, lekin toʻlov amalga oshirilmadi. <i>Iltimos, biz bilan bog'laning.</i>

source: <b>Заказ №%s доставлен без получения оплаты! Спасибо.</b> Вам назначено <b>%s</b> заказов(а). Всего заказов: <b>%s</b> <i>Выберите заказ из списка ниже:</i>
uz: <b>Buyurtma #%s toʻlovsiz yetkazib berildi! Rahmat.</b> Sizda <b>%s</b> ta buyurtma berilgan. Jami buyurtmalar: <b>%s</b> <i>Quyidagi roʻyxatdan buyurtmani tanlang:</i>

source: Добавьте комментарий к вашему заказу Или нажмите на соответствующую кнопку
uz: Buyurtmangizga sharh qo'shing yoki tegishli tugmani bosing

source: <b>Напишите комментарий к заказу:</b> Комментариев не добавлено
uz: <b>Buyurtmaga sharh yozing:</b> Izoh qo'shilmagan

source: Наличные 💵
uz: Naqd pul 💵

source: <b>Выберите способ оплаты:</b>
uz: <b>To'lov usulini tanlang:</b>

source: <b>Напишите комментарий к заказу </b>
uz: <b>Buyurtmaga sharh yozing </b>

source: <b>Комментарий:</b>
uz: <b>Izoh:</b>

source: Наличные
uz: Naqd pul

source: <b>Содержимое:</b>
uz: <b>Tarkib:</b>

source: Тип: Доставка Адрес: %s Номер: %s Способ оплаты: %s
uz: Turi: Yetkazib berish Manzili: %s Raqam: %s To‘lov usuli: %s

source: <b>Подтвердите заказ:</b> Тип: Доставка Адрес: %s Номер: %s Способ оплаты: %s
uz: <b>Buyurtmani tasdiqlash:</b> Turi: Yetkazib berish Manzili: %s Raqam: %s Toʻlov usuli: %s

source: Комментарий: %s
uz: Izohlar: %s

source: <b>Доставка</b> = <b><i>%s %s</i></b> <b><i>%s: </i>%s %s</b> <b><i>Заказ оформлен</i></b> <i>Скоро с вами свяжется оператор</i>
uz: <b>Yetkazib berish</b> = <b><i>%s %s</i></b> <b><i>%s:</i> %s %s</b> <b><i>Buyurtma tugallandi</i></b> <i>Operator tez orada siz bilan bog‘lanadi</i>

source: <b>Доставка</b> = <b><i>%s %s</i></b> <b><i>%s: </i>%s %s</b> <i>Доставим товары в течение часа</i> <b><i>Вы подтверждаете заказ?</i></b>
uz: <b>Yetkazib berish</b> = <b><i>%s %s</i></b> <b><i>%s:</i> %s %s</b> <i>Tovarni bir soat ichida yetkazib beramiz</i> <b><i>Buyurtmani tasdiqlaysizmi?</i></b>

source: Тип: Самовывоз Филиал: %s Номер: %s Способ оплаты: %s
uz: Turi: Olib ketish Filiali: %s Raqam: %s To‘lov usuli: %s

source: <b>Подтвердите заказ:</b> Тип: Самовывоз Филиал: %s Номер: %s Способ оплаты: %s
uz: <b>Buyurtmani tasdiqlash:</b> Turi: Olib ketish Filiali: %s Raqam: %s To‘lov usuli: %s

source: <b><i>%s: </i>%s %s</b> <b><i>Заказ оформлен</i></b> <i>Скоро с вами свяжется оператор</i>
uz: <b><i>%s:</i> %s %s</b> <b><i>Buyurtma bajarildi</i></b> <i>Operator tez orada siz bilan bog‘lanadi</i>

source: <b><i>%s: </i>%s %s</b> <i>Приготовим ваш заказ в течение часа</i> <b><i>Вы подтверждаете заказ?</i></b>
uz: <b><i>%s:</i> %s %s</b> <i>Buyurtmangiz bir soat ichida tayyor bo‘ladi.</i> <b><i>Buyurtmani tasdiqlaysizmi?</i></b>

source: <b>Выбрано:</b> %s
uz: <b>Tanlangan:</b> %s

source: Подтверждаю ✔
uz: Tasdiqlash ✔

source: Отменить ✖
uz: Bekor qilish ✖

source: <b>Заказ №%s</b>
uz: <b>Buyurtma №%s</b>

source: <b>Новый заказ:</b> %s Ожидает вашего подтверждения
uz: <b>Yangi buyurtma:</b> %s Tasdiqlash kutilmoqda

source: Самовывоз
uz: Termoq

source: Хотите ли вы использовать данные с последнего заказа? <b>Тип доставки:</b> %s <b>Адрес доставки:</b> %s <b>Филиал:</b> %s <b><i>Или хотите использовать новые данные?</i></b>
uz: Oxirgi buyurtma ma'lumotlaridan foydalanmoqchimisiz? <b>Yetkazib berish turi:</b> %s <b>Yetkazib berish manzili:</b> %s <b>Filial:</b> %s <b><i>Yoki yangi maʼlumotlardan foydalanmoqchimisiz?</i></b>

source: Использовать предыдущие данные 📝
uz: Oldingi maʼlumotlardan foydalaning 📝

source: Использовать новые данные 📄
uz: Yangi maʼlumotlardan foydalaning 📄

source: Доставка 🚕
uz: Yetkazib berish 🚕

source: Самовывоз 🏃
uz: Olib ketish 🏃

source: Вам нужна доставка или самовывоз?
uz: Sizga yetkazib berish yoki olib ketish kerakmi?

source: Начнем заказ?
uz: Buyurtma berishni boshlaymizmi?

source: Выберите один из вариантов на клавиатуре
uz: Klaviaturadagi variantlardan birini tanlang

source: Отправить локацию 📍
uz: Joylashuvni yuboring 📍

source: Пожалуйста, отправьте вашу локацию вручную или с помощью кнопки для определения ближайшего до Вас филиала для доставки
uz: Joylashuvingizni qoʻlda yuboring yoki yetkazib berish uchun sizga eng yaqin filialni aniqlash uchun tugmani ishlating

source: Ваш адрес %s. Вы подтверждаете данный адрес или хотите отправить заново?
uz: Sizning manzilingiz: %s. Bu manzilni tasdiqlayapsizmi yoki qayta yubormoqchimisiz?

source: Подтвердить ✔
uz: Tasdiqlash ✔

source: Отправить заново 📍
uz: Yana yuboring 📍

source: Выбран филиал: %s Расстояние до него %s км. Стоимость доставки: %s сум Начнем заказ?
uz: Filial tanlandi: %s Filialgacha boʻlgan masofa %s km. Yetkazib berish narxi: %s so'm Buyurtmani boshlaymizmi?

source: Пожалуйста, отправьте вашу локацию вручную или с помощью кнопки для определения ближайшего до Вас филиала для самовывоза
uz: Joylashuvingizni qoʻlda yuboring yoki olib ketish uchun sizga eng yaqin filialni aniqlash uchun tugmani ishlating

source: Ближайший филиал:
uz: Eng yaqin filial:

source: >Google</a> Расстояние до него:
uz: >Google</a> Ungacha bo'lgan masofa:

source: км. Желаете заказать в нем или выбрать другой филиал?
uz: km. Unda buyurtma berishni xohlaysizmi yoki boshqa filialni tanlaysizmi?

source: Сохранить 📝
uz: Saqlash 📝

source: Выбрать другой 🏠
uz: Boshqasini tanlang 🏠

source: Вы выбрали филиал: %s
uz: Siz tanlagan filial: %s

source: Выберите филиал из списка ниже:
uz: Quyidagi ro'yxatdan filialni tanlang:

source: Выбран филиал: %s Желаете заказать в нем или выбрать другой филиал?
uz: Filial tanlandi: %s Ushbu filialdan buyurtma berishni xohlaysizmi yoki boshqa filialni tanlaysizmi?

source: Неверный филиал. Попробуйте еще раз.
uz: Yaroqsiz filial. Yana bir bor urinib ko `ring.

source: Приступим к оформлению?
uz: Keling, bezashni boshlaylik, shundaymi?

source: Неизвестная команда Нажмите /start для перезапуска
uz: Noma&#39;lum buyruq Qayta boshlash uchun /start tugmasini bosing

source: Список команд:
uz: Buyruqlar ro'yxati:

source: /start - Запуск бота
uz: /start - Botni ishga tushiring

source: /order - Начать заказ
uz: /order - Buyurtmani boshlang

source: /help - Помощь
uz: / yordam - Yordam

source: Заказы принимаются с <b>%s:00</b> до <b>%s:00</b>
uz: Buyurtmalar <b>%s:00</b> dan <b>%s:00</b> gacha qabul qilinadi

source: Выбрана категория: %s
uz: Tanlangan turkum: %s

source: Такой категории не существует
uz: Bu turkum mavjud emas

source: <b>%s </b><i>%s </i>%s сум <b>Выберите количество:</b>
uz: <b>%s </b><i>%s </i> %s s'om <b>Miqdorni tanlang:</b>

source: Товар добавлен в корзину, продолжим?
uz: Bu narsa savatga qo'shildi, davom etamizmi?

source: Неверный формат,выберите количество товара ниже или введите число вручную
uz: Format noto‘g‘ri, quyidagi miqdorni tanlang yoki raqamni qo‘lda kiriting

source: Заказ №%s от %s
uz: %s dan №%s buyurtma qiling

source: <b>Список последних 10 заказов</b> Выберите заказ для просмотра:
uz: <b>Oxirgi 10 ta buyurtmalar roʻyxati Koʻrish uchun buyurtmani</b> Ko'rish uchun buyurtmani tanlang:

source: <b>Главное меню 🌫</b>
uz: <b>Asosiy menyu 🌫</b>

source: Ожидает подтверждения ⌛
uz: Tasdiqlash kutilmoqda ⌛

source: В процессе приготовления 🍳
uz: Pishirish jarayonida 🍳

source: В процессе доставки 🚚
uz: Yetkazib berish davom etmoqda 🚚

source: Доставлен ✅
uz: Yetkazib beriladi✅

source: Отменен ❌
uz: Bekor qilingan ❌

source: <i><b>Статус заказа: %s</b></i>
uz: <i><b>Buyurtma holati: %s</b></i>

source: Заказ не найден
uz: Buyurtma topilmadi

source: <b>Настройки</b> Имя: %s Язык: %s Номер: %s Количество заказов: %s Кешбек: %s Дата регистрации: %s
uz: <b>Sozlamalar</b> Nomi: %s Til: %s Raqam: %s Buyurtmalar soni: %s Keshbek: %s Ro‘yxatdan o‘tgan sana: %s

source: <i>Что Вы бы хотели изменить?</i>
uz: <i>Nimani o'zgartirmoqchisiz?</i>

source: Имя 📝
uz: Ism 📝

source: Номер 📱
uz: Raqam 📱

source: Язык 💬
uz: Til 💬

source: <b>Изменение имени</b> Ваше предыдущее имя: %s <i>Введите новое Имя</i>
uz: Ismni <b>o'zgartirish</b> Oldingi ismingiz: %s <i>Yangi nom kiriting</i>

source: <b>Изменение номера</b> Ваш текущий номер: %s <i>Отправьте ваш номер или введите его в формате +998911234567</i>
uz: <b>Raqamni o'zgartirish</b> Sizning joriy raqamingiz: %s <i>Raqamingizni yuboring yoki uni +998911234567 formatida kiriting</i>

source: Отправить номер телефона 📲
uz: Telefon raqamingizni yuboring 📲

source: Данный номер уже зарегистрирован Введите другой номер
uz: Bu raqam allaqachon ro'yxatdan o'tgan Boshqa raqamni kiriting

source: На ваш номер был отправлен код, пожалуйста введите его ниже. %s
uz: Raqamingizga kod yuborildi, uni pastga kiriting. %s

source: Неправильный формат. Пожалуйста, отправьте ваш номер или введите его в формате +998911234567
uz: Noto'gri shakl. Raqamingizni yuboring yoki +998911234567 formatida kiriting

source: <i>Ваш номер успешно изменен на <b>%s</b></i>
uz: <i>Raqamingiz <b>%s ga</b> muvaffaqiyatli almashtirildi</i>

source: Неверный код. Пожалуйста, введите его заново.
uz: Noto'g'ri kod. Iltimos, uni qayta kiriting.

source: <i>Ваше имя успешно изменено на <b>%s</b></i>
uz: <i>Ismingiz muvaffaqiyatli <b>%s ga</b> almashtirildi</i>

source: <i>Til muvaffaqiyatli %s ga o'zgartirildi</i>
uz: <i>Til tezlik %s ga o'zgartirildi</i>

source: Приступим к оформлению? 📝
uz: Keling, bezashni boshlaylik, shundaymi? 📝

source: Отправить номер 📲
uz: Raqam yuboring 📲

source: Отправьте ваш номер или введите его в формате +998911234567
uz: Raqamingizni yuboring yoki +998911234567 formatida kiriting

source: Уважаемый %s! Вы успешно зарегистрировались! Ваш язык: %s Ваш номер: %s
uz: Hurmatli %s! Siz ro'yxatdan o'tdingiz! Tilingiz: %s Telefon raqamingiz: %s
